app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `updated_at`, `ip`, `email`, `created_at`) VALUES('asdads', '2009-05-29 19:24:47', NULL, 'adam@benchmedia.co.uk', '2009-05-29 19:24:47')
---
  def create
    @user = User.new(params[:user])
    @user.ip = request.env['REMOTE_ADDR']
    if @user.save